Repository: omarAziz-94/ts
Catalog: lib/l10n/arb/app_*.arb
Languages: ar

source: About App
ar: عن التطبيق

source: Email
ar: البريد الالكتروني

source: Password
ar: كلمة المرور

source: Login
ar: تسجيل الدخول

# welcomeSub
source: Get moving with Safe Bus
ar: تحرك مع الحافلة الآمنة

# welcomeText
source: Welcome {userName}!
ar: مرحبا {userName}!

source: Sons List
ar: قائمة الأبناء

source: Notifications
ar: الإشعارات

source: Mark all as read
ar: تحديد الكل كمقروء

source: Settings
ar: الإعدادات

source: OK
ar: موافق

source: Go
ar: اذهب

source: My Children
ar: أبناءي

source: Logout
ar: تسجيل الخروج

source: Date
ar: التاريخ

source: Check in
ar: تسجيل الدخول

source: Check-Out
ar: تسجيل الخروج

source: Recent Trips
ar: أحدث الرحلات

source: See all
ar: عرض الكل

source: Something
ar: شيء آخر

source: Driver details
ar: تفاصيل السائق

# pickUpLocation
source: Pick-up / Drop-off location
ar: مكان الاستلام / الإنزال

# inText
source: In
ar: دخول

source: out
ar: خروج

source: To
ar: إلى

source: From
ar: من

source: School
ar: المدرسة

source: Home
ar: المنزل

source: Something went wrong
ar: حدث خطأ ما

# invalidCredentials
source: Could not authenticate with those credentials
ar: البيانات غير صحيحة

# cannotFetchUser
source: Could not fetch user
ar: لا يمكن الحصول على المستخدم

# cannotStartTour
source: Could not start tour
ar: لا يمكن بدء الرحلة

# cannotFetchLines
source: Could not fetch lines
ar: لا يمكن الحصول على الخطوط

source: Tour already started
ar: رحلة مبدئة مسبقا

source: Tour failed to start
ar: لم يتم بدء الرحلة

# tourNotStarted
source: Tour not started yet
ar: لم يتم بدء الرحلة

source: Tour already ended
ar: رحلة منتهية مسبقا

# cannotEndTour
source: Could not end tour
ar: لا يمكن انهاء الرحلة

# cannotAttendStudent
source: Could not attend student
ar: لا يمكن تسجيل حضور الطالب

# cannotStartStation
source: Could not start station
ar: لا يمكن بدء المحطة

# cannotFetchStudents
source: Could not fetch students
ar: لا يمكن الحصول على الطلاب

# studentAlreadyAttended
source: Student already attending
ar: الطالب حاضر بالفعل

source: Invalid Driver Card
ar: بطاقة السائق غير صحيحة

# checkConnection
source: Please check your internet connection and try again
ar: تحقق من الاتصال بالانترنت ، حاول مجددا

# notAllowedToAccess
source: Not allowed to access this resource
ar: غير مسموح لك بالدخول لهذه المعلومات

# cannotFindData
source: Could not find the data
ar: لا يمكن الحصول على البيانات

# someThingWentWrongTryAgain
source: Something went wrong, please try again later
ar: حدث خطأ ما، حاول مرة اخرى

# noStudents
source: No students found
ar: لا يوجد طلاب

# cannotFetchTrips
source: Could not fetch the recent trips
ar: لا يمكن الحصول على الرحلات

# cannotFetchTripsHistory
source: Could not fetch trips history
ar: لا يمكن الحصول على تاريخ الرحلات

source: No active trips
ar: لا رحلات حاليه

# noHistory
source: No Trip History
ar: لا يوجد رحلات سابقه

# internal_error
source: An internal error has occurred.
ar: حدث خطأ ما، حاول مرة اخرى

# invalid_email
source: The email address is badly formatted.
ar: البريد الالكتروني غير صحيح

# invalid_credential
source: The supplied auth credential is malformed or has expired.
ar: البيانات غير صحيحة

# wrong_password
source: The password is invalid or the user does not have a password.
ar: كلمة المرور غير صحيحة

# timeout
source: The operation has timed out.
ar: انتهى الوقت، حاول مرة اخرى

# too_many_requests
source: We have blocked all requests from this device due to unusual activity. Try again later.
ar: انتهى الحد الاقصى للطلبات، حاول مرة اخرى لاحقا

# unverified_email
source: The operation requires a verified email.
ar: البريد الالكتروني غير مفعل

# user_cancelled
source: The user did not grant your application the permissions it requested.
ar: المستخدم تم إلغاء الطلب

# user_not_found
source: There is no user record corresponding to this identifier. The user may have been deleted.
ar: المستخدم غير موجود

# user_disabled
source: The user account has been disabled by an administrator.
ar: تم تعطيل الحساب
